{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_3251",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 6,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense6501",
            "trainable": true,
            "batch_input_shape": [null, 8],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 2,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense6502",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 2.0.0",
    "backend": "tensor_flow.js"
  },
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v2.0.0",
  "convertedBy": null,
  "weightsManifest": [
    {
      "paths": ["./model.weights.bin"],
      "weights": [
        {
          "name": "dense_Dense6501/kernel",
          "shape": [8, 6],
          "dtype": "float32"
        },
        { "name": "dense_Dense6501/bias", "shape": [6], "dtype": "float32" },
        {
          "name": "dense_Dense6502/kernel",
          "shape": [6, 2],
          "dtype": "float32"
        },
        { "name": "dense_Dense6502/bias", "shape": [2], "dtype": "float32" }
      ]
    }
  ]
}
